-- Ex01
-- Кино бүрийн гарчиг, түрээсийн үнэ болон replacement_cost харуулах SQL хүсэлт бичих. 
-- Баганын гарчгуудыг дараах нэрээр солино: "Киноны нэр", "Түрээсийн үнэ", "Солих өртөг".
SELECT 
    title AS "Киноны нэр",
    rental_rate AS "Түрээсийн үнэ",
    replacement_cost AS "Солих өртөг"
FROM 
    film
ORDER BY 
    replacement_cost DESC;
-- Ex02 
-- Кинонуудын давтагдахгүй үнэлгээнүүдийг (rating) харуулах SQL хүсэлт бичих.

-- Ex03
-- Бүх үйлчлүүлэгчдийн овог, нэрийг харуулах SQL хүсэлт бичих. 
-- Эхлээд овгоор цагаан толгойн дарааллаар, 
-- хэрэв овог ижил бол нэрээр цагаан толгойн дарааллаар эрэмбэлнэ.

-- Ex04
-- Түрээсийн үнэ нь 2.99-ээс их, үргэлжлэх хугацаа нь 100 минутаас урт, 
-- үнэлгээ нь 'PG-13' байх киноны нэр болон үргэлжлэх хугацааг харуулах SQL хүсэлт бичих.

-- Ex05
-- Киноны гарчиг 'Love' гэдэг үгээр эхэлсэн эсвэл 'Romance' 
-- гэдэг үгээр төгссөн киноны мэдээллийг харуулах SQL хүсэлт бичих.

-- Ex06
-- Хамгийн их түрээсийн хугацаатай 5 киноны нэр болон түрээсийн хугацааг харуулах SQL хүсэлт бичих.

-- Ex07
-- Үнэлгээ нь 'G', 'PG', эсвэл 'PG-13' байх киноны нэр, үнэлгээ, тайлбарыг харуулах SQL хүсэлт бичих.

-- Ex08
-- 2007 оны 2-р сарын 15-аас 20-ны хооронд хийгдсэн төлбөрүүдийг харуулах SQL хүсэлт бичих.

-- Ex09
-- Нэр нь 'A' үсгээр эхэлж, овог нь 'N' үсгээр төгссөн бүх жүжигчдийн мэдээллийг харуулах SQL хүсэлт бичих.

-- Ex10
-- Эх хэл нь тодорхойлоогүй (original_language_id IS NULL) киноны мэдээллийг харуулах SQL хүсэлт бичих.


-- BONUS
-- Дараах шалгууруудыг хангасан үр дүнг харуулах SQL хүсэлт бичих:

-- Үнэлгээ нь 'G', 'PG' эсвэл 'PG-13' байх
-- Түрээсийн үнэ нь 0.99-өөс 4.99-ийн хооронд байх
-- Үргэлжлэх хугацаа нь 60-аас 120 минутын хооронд байх
-- Тайлбарт 'drama', 'documentary' эсвэл 'family' гэсэн үг агуулагдсан
-- Оригинал хэл нь тодорхойлогдоогүй (NULL)
-- Хамгийн өндөр replacement cost 
-- 10 киног харуулах

