package lesson_day_68;

public class CommandLine {

	public static void main(String[] args) {
		for (int i = 0; i < args.length; i++) {
			System.out.println("args[" + i + "]: " + args[i]);
		}
	}
	
//	Calculator гэдэг класс үүсгээд түүндээ operand1/operand2/operator гэдэг нэртэй 
	// 3 instance variable үүсгээрэй. үүнд эхний operand1 нь жишээ нь эхний
	// аргументийг, operator нь нэмэх хасах үржих хуваах үйлдлийг operator2 нь 
	// аргументийн 3-р утга гэх мэтээр хадгална. Конструкторийг нь энэхүү аргументуудыг
	// авдаг болгоорой.
	// Operand1 = 0
	// Operand2 = 0
	// Operator = "+"
	// Жишээ нь: Одоо аргументээр нь 5 * 5 гэж өгөхөд 
	// 9 гэж хэвлэдэг болгоно.
	
//	Энэхүү класс нь 4 арифметик үйлдэл хийдэг функцтэй байна.
	// функц болгон 2 параметртай
	
	
	// main method дотор аргументийн операторын утгаас хамааран
	// хэрвээ жишээ нь * тэмдэг байвал түүнийг 2 өгөгдсөн утгыг нь үржүүлээд
	// хариуг нь хэвлэдэг болгоно.
	
	// argument дээр нь 5 * 5 гэж өгсөн бол
	// Та үржих үйлдэл сонгосон байна.
	// Таны хариу 25 гэх мэтээр хэвлэнэ гэсэн үг.
	

}
