
public class Exercises {
    // Ex01
    // Параметраар өгөгдсөн text-ийн уртыг нь олоод буцаадаг функц бичээд
    // 3 өөр утгаар тестэлнэ үү

    // Ex02
    // Параметраар өгөгдсөн text-ийн утгыг нь том үсэгтэй болгоод буцаадаг
    // функц бичээрэй. 3 өөр утгаар тестлээрэй.

    // Ex03
    // Параметраар өгөгдсөн text-ийн хамгийн сүүлийн болон хамгийн 
    // эхний үсгүүдийг нь хэвлэдэг функц бичээрэй. 3 өөр утгаар тестлээрэй.

    // Ex04
    // 2 текстийг Параметраар өгнө. Энэхүү функц нь энэхүү 2 параметрийг
    // нийлүүлээд хамтад нь залгаад буцаадаг функц байна. 3 өөр утгаар тестлээрэй.

    // Ex05
    // Энэхүү функц нь 2 параметр авна. Эхнийх нь текст дараагийнх нь энэ текстэнд 
    // байгаа character-ийг хайна. Хэрвээ тухайн character нь текстэнд байвал 
    // үсэг байна үгүй бол үсэг байхгүй гэж хэвлэдэг болгоно. 3 өөр утгаар тестлээрэй.
}
